---
type: FailureHandlingOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# FailureHandlingOptions

`Autodesk.Revit.DB.FailureHandlingOptions` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetClearAfterRollback | 2011 | `public bool GetClearAfterRollback ()` |
| Method | GetDelayedMiniWarnings | 2011 | `public bool GetDelayedMiniWarnings ()` |
| Method | GetFailuresPreprocessor | 2011 | `public IFailuresPreprocessor GetFailuresPreprocessor ()` |
| Method | GetForcedModalHandling | 2011 | `public bool GetForcedModalHandling ()` |
| Method | GetTransactionFinalizer | 2011 | `public ITransactionFinalizer GetTransactionFinalizer ()` |
| Method | SetClearAfterRollback | 2011 | `public FailureHandlingOptions SetClearAfterRollback ( bool bFlag )` |
| Method | SetDelayedMiniWarnings | 2011 | `public FailureHandlingOptions SetDelayedMiniWarnings ( bool bFlag )` |
| Method | SetFailuresPreprocessor | 2011 | `public FailureHandlingOptions SetFailuresPreprocessor ( IFailuresPreprocessor preprocessor )` |
| Method | SetForcedModalHandling | 2011 | `public FailureHandlingOptions SetForcedModalHandling ( bool bFlag )` |
| Method | SetTransactionFinalizer | 2011 | `public FailureHandlingOptions SetTransactionFinalizer ( ITransactionFinalizer finalizer )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |